app/controllers/application_controller.rb

    def current_user
        User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "wFQVTPn11rXbB0dd0Fv5UQ"], ["LIMIT", 1]]